{
    "products": [
        {
            "id": 1,
            "name": "Guava Danish",
            "description": "Delicado danés relleno con crema dulce y tropical de guayaba.",
            "longDescription": "Delicado danés relleno con crema dulce y tropical de guayaba. El equilibrio perfecto entre la masa hojaldrada y el relleno afrutado, este danés de guayaba es un delicioso capricho para cualquier momento del día.",
            "price": 3.0,
            "category": "bolleria",
            "image": "src/assets/products_img/guava_danish.png"
        },
        {
            "id": 2,
            "name": "Caramel Apple Pie",
            "description": "Tarta de manzana clásica con un rico topping de caramelo y corteza crujiente.",
            "longDescription": "Tarta de manzana clásica con un rico topping de caramelo y corteza crujiente. Un postre perfecto que combina la acidez de la manzana con la dulzura del caramelo.",
            "price": 4.0,
            "category": "bolleria",
            "image": "src/assets/products_img/caramel_apple_pie.png"
        },
        {
            "id": 3,
            "name": "Almond Croissant",
            "description": "Croissant mantecoso y hojaldrado relleno con crema dulce de almendra.",
            "longDescription": "Este croissant, mantecoso y hojaldrado, está relleno de una rica crema dulce de almendra, creando una combinación perfecta de texturas y sabores.",
            "price": 3.5,
            "category": "bolleria",
            "image": "src/assets/products_img/almond_croissant.png"
        },
        {
            "id": 4,
            "name": "Fruit Pastry",
            "description": "Pastel colorido cubierto con frutas frescas de temporada y crema ligera.",
            "longDescription": "Este pastel de frutas es una opción refrescante, con frutas frescas de temporada y una capa ligera de crema que combina perfectamente con la base hojaldrada.",
            "price": 5.0,
            "category": "bolleria",
            "image": "src/assets/products_img/fruit_pastry.png"
        },
        {
            "id": 5,
            "name": "Strawberry Croissant",
            "description": "Croissant crujiente relleno con fresas frescas y una delicada crema.",
            "longDescription": "Este croissant, con su suave masa y relleno de fresas frescas, es una opción perfecta para los amantes de los postres frutales.",
            "price": 4.0,
            "category": "bolleria",
            "image": "src/assets/products_img/strawberry_croissant.png"
        },
        {
            "id": 6,
            "name": "Purple Sweet Potato Loaf",
            "description": "Todo natural, suave y esponjoso, lleno de sabor y sutiles notas dulces.",
            "longDescription": "Este pan de batata morada es completamente natural, con una textura suave y un sabor sutilmente dulce que lo hace único.",
            "price": 3.0,
            "category": "panaderia",
            "image": "src/assets/products_img/purple_sweet_potato_loaf.png"
        },
        {
            "id": 7,
            "name": "Taro Cream Bread",
            "description": "Pan suave con aroma a taro y crema.",
            "longDescription": "Este pan es ligero y suave, con un aroma sutil a taro y relleno con una rica crema que le da un sabor delicioso.",
            "price": 4.5,
            "category": "panaderia",
            "image": "src/assets/products_img/chocolate_dipped_belgium_waffle.png"
        },
        {
            "id": 8,
            "name": "Sweet Frank Roll",
            "description": "Rollo suave y esponjoso con un toque salado de salchicha de res y queso mozzarella.",
            "longDescription": "Este delicioso rollo está hecho con una masa suave de pan enriquecida con ingredientes como mantequilla, crema espesa y leche, lo que le da una textura perfecta. Dentro, encontrarás una sabrosa salchicha de res acompañada de queso mozzarella rallado, creando una combinación irresistible. La cobertura de huevo y las hojuelas de perejil le aportan un toque final de frescura y sabor. Es el snack ideal para cualquier momento del día.",
            "price": 2.8,
            "category": "panaderia",
            "image": "src/assets/products_img/salt_butter_roll.png"
        },
        {
            "id": 9,
            "name": "Buttercream Bread",
            "description": "Pan suave relleno con crema de mantequilla dulce.",
            "longDescription": "Este pan es la combinación perfecta de suavidad y dulzura, con una rica crema de mantequilla que se derrite en cada bocado.",
            "price": 3.5,
            "category": "panaderia",
            "image": "src/assets/products_img/buttercream_bread.png"
        },
        {
            "id": 10,
            "name": "Blueberry Cream Cheese Bread",
            "description": "Pan con arándanos y relleno de queso crema.",
            "longDescription": "Este pan tiene un delicioso sabor de arándanos frescos combinados con el suave y cremoso queso crema, creando una combinación exquisita.",
            "price": 4.0,
            "category": "panaderia",
            "image": "src/assets/products_img/blueberry_cream_cheese_bread.png"
        },
        {
            "id": 11,
            "name": "Earl Grey Cloud",
            "description": "Pastel ligero y aireado con sabor a té Earl Grey.",
            "longDescription": "Este pastel es delicado y esponjoso, infusionado con el suave y aromático sabor del té Earl Grey, creando una experiencia única.",
            "price": 6.0,
            "category": "pasteleria",
            "image": "src/assets/products_img/earl_grey_cloud.png"
        },
        {
            "id": 12,
            "name": "Blueberry Yogurt ",
            "description": "Pastel de yogurt con arándanos frescos, ligero y refrescante.",
            "longDescription": "Este pastel de yogurt es ligero y refrescante, con la combinación perfecta de frescura de los arándanos y la suavidad del yogurt.",
            "price": 6.5,
            "category": "pasteleria",
            "image": "src/assets/products_img/blueberry_yogurt_3.png"
        },
        {
            "id": 13,
            "name": "Mango Cloud",
            "description": "Pastel cremoso de yogurt con un sabor fresco y exótico de mango.",
            "longDescription": "Este pastel de yogurt con mango ofrece una mezcla de suavidad y cremosidad, con el sabor vibrante y tropical del mango que realza su textura suave. Es una opción refrescante y deliciosa para los amantes de los postres frutales, con un toque sutil de frescura y dulzura natural.",
            "price": 6.5,
            "category": "pasteleria",
            "image": "src/assets/products_img/mango_cloud.png"
        },
        {
            "id": 14,
            "name": "Strawberry Lychee",
            "description": "Pastel que combina frescas fresas y la exótica fruta de lichí.",
            "longDescription": "Este pastel presenta una mezcla perfecta de fresas dulces y la refrescante y exótica fruta de lichí, creando una experiencia de sabor única.",
            "price": 7.0,
            "category": "pasteleria",
            "image": "src/assets/products_img/strawberry_lychee.png"
        },
        {
            "id": 15,
            "name": "Strawberry Gateau",
            "description": "Elegante pastel gateau con capas de fresa y crema.",
            "longDescription": "Este pastel gateau es una opción elegante y deliciosa, con capas de fresas frescas y suave crema que se combinan de manera perfecta.",
            "price": 7.5,
            "category": "pasteleria",
            "image": "src/assets/products_img/strawberry_gateau.png"
        },
        {
            "id": 16,
            "name": "Egg & Cheese Morning Bun",
            "description": "Bollo esponjoso de la mañana relleno con huevo y queso derretido.",
            "longDescription": "Este bollo esponjoso y sabroso está relleno con huevo y queso derretido, creando una opción perfecta para el desayuno.",
            "price": 4.5,
            "category": "sandwiches",
            "image": "src/assets/products_img/egg_cheese_morning_bun.png"
        },
        {
            "id": 17,
            "name": "Egg & Bacon Cheese Croissant Sandwich",
            "description": "Sándwich de croissant con huevo, bacon crujiente y queso derretido.",
            "longDescription": "Este sándwich de croissant es una combinación deliciosa de huevo, bacon crujiente y queso derretido, perfecto para un desayuno o almuerzo.",
            "price": 5.5,
            "category": "sandwiches",
            "image": "src/assets/products_img/egg_bacon_cheese_croissant_sandwich.png"
        },
        {
            "id": 18,
            "name": "Jalapeño Ham & Cheese Croissant Sandwich",
            "description": "Sándwich de croissant con jamón, queso y un toque picante de jalapeño.",
            "longDescription": "Este sándwich de croissant tiene un sabor equilibrado, con jamón, queso y un toque picante de jalapeño para un sabor único.",
            "price": 6.0,
            "category": "sandwiches",
            "image": "src/assets/products_img/jalapeno_ham_cheese_croissant_sandwich.png"
        },
        {
            "id": 19,
            "name": "Turkey & Cheese Croissant",
            "description": "Sándwich clásico de croissant con pavo y queso.",
            "longDescription": "Este sándwich de croissant es clásico y delicioso, con pavo y queso derretido en una combinación perfecta.",
            "price": 5.0,
            "category": "sandwiches",
            "image": "src/assets/products_img/turkey_cheese_croissant.png"
        },
        {
            "id": 20,
            "name": "Tuna Salad Sandwich",
            "description": "Sándwich de ensalada de atún fresco en el pan de tu elección.",
            "longDescription": "Este sándwich está relleno con una fresca ensalada de atún, una opción deliciosa y saludable para cualquier momento del día.",
            "price": 5.8,
            "category": "sandwiches",
            "image": "src/assets/products_img/tuna_salad_sandwich.png"
        }
    ]
}